04_OpenFoam/_Tut_02/OpenFOAM-14/fluid/blockedChannel/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

volumeBlockage
{
    type            volumeBlockage;
    volumePhase     volume;
}

solidBlockage
{
    type            volumeBlockage;
    volumePhase     solid;
}

solidThermalEquilibrium
{
    type            solidThermalEquilibrium;
    solidPhase      solid;
}

// ************************************************************************* //
